###################################################################

# Created by write_sdc on Sat Feb  5 00:33:27 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {instruction_addr[31]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[30]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[29]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[28]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[27]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[26]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[25]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[24]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[23]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[22]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[21]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[20]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[19]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[18]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[17]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[16]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[15]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[14]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[13]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[12]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[11]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[10]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[9]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[8]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[7]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[6]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[5]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[4]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[3]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[2]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[1]}]
set_load -pin_load 3.40189 [get_ports {instruction_addr[0]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[63]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[62]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[61]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[60]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[59]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[58]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[57]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[56]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[55]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[54]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[53]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[52]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[51]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[50]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[49]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[48]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[47]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[46]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[45]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[44]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[43]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[42]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[41]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[40]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[39]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[38]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[37]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[36]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[35]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[34]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[33]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[32]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[31]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[30]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[29]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[28]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[27]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[26]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[25]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[24]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[23]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[22]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[21]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[20]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[19]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[18]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[17]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[16]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[15]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[14]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[13]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[12]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[11]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[10]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[9]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[8]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[7]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[6]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[5]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[4]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[3]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[2]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[1]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_addr[0]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[63]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[62]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[61]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[60]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[59]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[58]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[57]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[56]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[55]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[54]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[53]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[52]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[51]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[50]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[49]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[48]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[47]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[46]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[45]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[44]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[43]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[42]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[41]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[40]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[39]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[38]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[37]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[36]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[35]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[34]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[33]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[32]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[31]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[30]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[29]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[28]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[27]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[26]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[25]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[24]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[23]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[22]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[21]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[20]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[19]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[18]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[17]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[16]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[15]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[14]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[13]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[12]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[11]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[10]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[9]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[8]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[7]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[6]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[5]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[4]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[3]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[2]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[1]}]
set_load -pin_load 3.40189 [get_ports {DataMemory_data[0]}]
set_load -pin_load 3.40189 [get_ports DataMemory_rd]
set_load -pin_load 3.40189 [get_ports DataMemory_wr]
create_clock [get_ports clk]  -name MY_CLK  -period 10  -waveform {0 5}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports clk]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports rst]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[63]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[62]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[61]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[60]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[59]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[58]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[57]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[56]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[55]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[54]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[53]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[52]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[51]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[50]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[49]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[48]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[47]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[46]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[45]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[44]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[43]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[42]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[41]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[40]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[39]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[38]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[37]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[36]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[35]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[34]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[33]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[32]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_addr[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[63]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[62]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[61]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[60]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[59]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[58]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[57]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[56]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[55]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[54]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[53]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[52]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[51]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[50]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[49]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[48]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[47]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[46]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[45]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[44]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[43]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[42]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[41]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[40]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[39]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[38]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[37]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[36]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[35]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[34]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[33]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[32]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_addr[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[63]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[62]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[61]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[60]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[59]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[58]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[57]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[56]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[55]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[54]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[53]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[52]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[51]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[50]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[49]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[48]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[47]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[46]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[45]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[44]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[43]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[42]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[41]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[40]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[39]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[38]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[37]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[36]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[35]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[34]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[33]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[32]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DataMemory_data[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports DataMemory_rd]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports DataMemory_wr]
